Tekla Open API Reference for Tekla Structures 2025
GeometrySection Properties
The GeometrySection type exposes the following members.
Properties
Name | Description
GeometryNode
 Gets the geometry node
Index
 Gets the index of the node
Top
See Also
Reference
GeometrySection Class
Tekla.Structures.Model Namespace